{
 "perfume": [
  {
   "name": "Halloween Man X",
   "url": "https://www.fragrancenet.com/cologne/jesus-del-pozo/halloween-man-x/edt#333627",
   "price": "$4.99",
   "comments": [
    {
     "comment": "Great fragrance, will be very nice for the cooler weather"
    },
    {
     "comment": "I'm pleased with this product the fragrance is wonderful, smells great"
    },
    {
     "comment": "Holloween Man X is a very good fragrance & would definitely recommend & buy again."
    },
    {
     "comment": "i get heavy complimens, just 5 of my best men cologne"
    },
    {
     "comment": "I'm no fragrance conneiseur, but I know this smells great. I've had compliments about it at work and I've noticed it has a fairly sweet scent, not as much as say Paco 1 Million, but mildly sweet. Its not incredibly strong but has some projection. I can understand why some people mentioned some light burnt smell, its not quite burnt, but if you stick your nose directly into your skin after the cologne was sprayed a while ago it does have an incredibly light ashy smell. Which would never come out unless someone was nose to skin with you, well after you initially spray it. I can still smell it hours after on my clothes (or skin if smelt directly), but the projection otherwise is a few hours, maybe 3-4."
    }
   ]
  },
  {
   "name": "Coach Platinum",
   "url": "https://www.fragrancenet.com/cologne/coach/coach-platinum/eau-de-parfum#314403",
   "comments": [
    {
     "comment": "A++ This… is a very nice fragrance. It’s calm, soft, soothing, ugh it’s just beautiful. If you want something crowd pleasing & that’s not overwhelming give this a try. Can be worn year round night/ day & doesn’t offend anyone. It’s such a sexy & classy scent. I smelled this on paper & immediately knew I was GOING to buy the 100ML. The smell is like a soft kinda sweet powder, you definitely get that tonka bean & sandalwood with a hint of leather in the background to keep a manly tone. Next to PDM Layton, this is my second favorite Cologne. It’s just sooo nice!! Highly recommended"
    },
    {
     "comment": "Coach Platinum is a great fragrance for everyday wear. This is another BANGER! Great gym scent!"
    },
    {
     "comment": "This is one of my favorites!!! Technically it’s for men but I got it for myself and I am a woman, of course every smell will be different on how it mixes with your natural smells but it has a nice fragrance and does not smell masculine on me. It has a slight sweet note on me and I just love it it’s kind of soft but still strong smelling but not overpowering. It stays on all day and even on my jacket I could smell it the next day."
    },
    {
     "comment": "This is one of my favorites!!! Technically it’s for men but I got it for myself and I am a woman, of course every smell will be different on how it mixes with your natural smells but it has a nice fragrance and does not smell masculine on me. It has a slight sweet note on me and I just love it it’s kind of soft but still strong smelling but not overpowering. It stays on all day and even on my jacket I could smell it the next day."
    },
    {
     "comment": "This is one of my favorites!!! Technically it’s for men but I got it for myself and I am a woman, of course every smell will be different on how it mixes with your natural smells but it has a nice fragrance and does not smell masculine on me. It has a slight sweet note on me and I just love it it’s kind of soft but still strong smelling but not overpowering. It stays on all day and even on my jacket I could smell it the next day."
    }
   ]
  },
  {
   "name": "Escape",
   "url": "https://www.fragrancenet.com/cologne/calvin-klein/escape/edt#122757",
   "comments": [
    {
     "comment": "I love Calvin Klein escape. Problem is I ordered it February 22 and it's still not here. I had a second order and it already came. Love the prices, discounts, and convenience."
    },
    {
     "comment": "One of my all time favorites! Great in ant season…"
    },
    {
     "comment": "I used to wear this back in the 90’s always loved it! Haven’t seen it in a while but shopping on here I saw it and ordered it and brought back great memories. Love it! I always gets compliments from Women even stopped and ask what it is I’m wearing. Is a great sexy smell. Buy it if you are on the fence about it you will not regret it!!"
    },
    {
     "comment": "LOVE THIS FRAGRANCE...IT IS THE BEST"
    },
    {
     "comment": "I am a woman and I've been ordering this for over 20 years it smells so clean and good. Also I used to have men stop me and ask what I was wearing they'd like to buy some for their wife! I told them it was a man's cologne they were shocked! Very clean long lasting smell."
    }
   ]
  },
  {
   "name": "Prada Luna Rossa Carbon",
   "url": "https://www.fragrancenet.com/cologne/prada/prada-luna-rossa-carbon/edt#322565",
   "comments": [
    {
     "comment": "One of my favorite Prada fragrances. It's so good. This and Luna Rossa Black are just amazing. Buying a few more bottles today. Love the Luna Rossa line. Can't go wrong with any. I haven't tried sport yet, but the other 4-5 are all very good. You won't regret buying a bottle of this."
    },
    {
     "comment": "This is an amazing fragrance! Easily the best one in my collection. It’s very light, but profoundly deep and complex. Prada LRC is a must have."
    },
    {
     "comment": "I love the smell"
    },
    {
     "comment": "All of these fragrances are good. Some a little stronger than others but they all are good"
    },
    {
     "comment": "Love this scent, recently picked it up for daily activities. Works really well, and isn't in anyone's face. I love the top notes. If there is one thing I would change, it would be the middle metallic notes that it fades in to. I'm just personally not aa huge fan of it. Good compliment getter, and very versitile!"
    }
   ]
  },
  {
   "name": "Spicebomb",
   "url": "https://www.fragrancenet.com/cologne/viktor-and-rolf/spicebomb/edt#221319",
   "comments": [
    {
     "comment": "Spicebomb for men smells very nice, but to my nose it smells almost identical to Copper Black by Kenneth Cole. Compare the two and you'll see what I mean. AND, Copper Black is a lot more affordable and lasts just as long as Spicebomb, if not longer, lol. Actually, I think I like Copper Black better because of its lasting property. They're both great though! A+!"
    },
    {
     "comment": "I missed the boat on this fragrance which came out in the year 2012. I’m glad I finally got it. It exceeded my expectations. A very masculine spicy fragrance with great performance it is more of a cold weather fragrance. I consider it a masterpiece, a must have in your collection. Highly recommend it!"
    },
    {
     "comment": "My husband loved his Christmas gift! Spice bomb is one of his best fragrances ever so it did not disappoint! I loved that my gift came on time, right before Christmas. Thanks so much! ❤️"
    },
    {
     "comment": "I Love spicebomb one of my favorites"
    },
    {
     "comment": "It is away from my expectations..................... niceeeeeeeeeeeeee"
    }
   ]
  },
  {
   "name": "Aramis",
   "url": "https://www.fragrancenet.com/cologne/aramis/aramis/edt#115487",
   "comments": [
    {
     "comment": "I love Aramis just for they scent of it. Everyone love Armis the smell last a long time. Women are also compilment me for the smell of Aramis."
    },
    {
     "comment": "Women always compliment me on how good I smell, and it drives my wife crazy!!! Need I say more.... It's Fantastic I HIGHLY RECOMMEND YOU TRY IT....."
    },
    {
     "comment": "it was a blind buy....Smells good with a lasting power, I love it"
    },
    {
     "comment": "To me it didn’t smell like the Aramis I was used to years ago."
    },
    {
     "comment": "I've used this cologne for many years but strangely enough I can't smell it on myself, however people tell me I smell delicious which makes me smile and improves my day. I've always liked the smell when someone else uses it and this is what attracted me to this particular scent. If you want to smell delicious..please then try Aramis. I even named my cat \" Aramis. \""
    }
   ]
  },
  {
   "name": "Maison Francis Kurkdjian Baccarat Rouge 540",
   "url": "https://www.fragrancenet.com/fragrances/maison-francis/maison-francis-kurkdjian-baccarat-rouge-540/eau-de-parfum#299119",
   "price": "$369.99",
   "comments": [
    {
     "comment": "This is a boss scent. Compliment machine very masculine but feminine at the sametime. 10/10 one of my best fragrances in my over 60 bottle collection"
    },
    {
     "comment": "This smells like rich people. I get so many compliments on it. Stays on forever. My new favorite"
    },
    {
     "comment": "This smells like rich people. I get so many compliments on it. Stays on forever. My new favorite"
    },
    {
     "comment": "I love my fragrance! I get so many compliments from family and strangers telling me I smell good. It smells very fresh and it last all day long. I would definitely recommend to a friend."
    },
    {
     "comment": "I am completely and totally addicted. It's the only fragrance I want to wear, and I hope it is never discontinued. After trying the sample, I bought a bottle even though it's more than I have ever considered paying for a fragrance. Then I treated myself to the body cream and the body oil. Because it seems to be a polarizing scent with those who either love it or hate it, i think body chemistry comes into play with BR540 even more than other fragrances."
    }
   ]
  },
  {
   "name": "Terre d'Hermes Eau Intense Vetiver",
   "url": "https://www.fragrancenet.com/cologne/hermes/terre-dhermes-eau-intense-vetiver/eau-de-parfum#328331",
   "comments": [
    {
     "comment": "One of the best citrus scents I own! Very unique with a lovely cedar dry down, stays on my skin for 10-12 hours! Highly recommend it!"
    },
    {
     "comment": "One of the best citrus scents I own! Very unique with a lovely cedar dry down, stays on my skin for 10-12 hours! Highly recommend it!"
    },
    {
     "comment": "Well I'm in love - from the crisp top which is just for me, to the vetiver floral dry down that has the longevity you would expect from a parfum. Definitely a scent bubble product - I love having it on and those who step in - compliment profusely."
    },
    {
     "comment": "I am TORN here... lol it's sooo Original and Striking.. I Like it for sure, not sure if I love it, DEFINATELY WORTH a try"
    },
    {
     "comment": "Hermès line are very good last very long and depending on your body chemistry choose your scent mine is citrus fir summer and cedar wood for winter. Love it."
    }
   ]
  },
  {
   "name": "Chrome Legend",
   "url": "https://www.fragrancenet.com/cologne/azzaro/chrome-legend/edt#154655",
   "comments": [
    {
     "comment": "Love this scent. It’s soft & clean."
    },
    {
     "comment": "Love the Chrome Legend it last forever and my wife like the way it smell on me also."
    },
    {
     "comment": "I’m pleased with this cologne, it has a pleasant and subtle fragrance."
    },
    {
     "comment": "I’m pleased with this cologne, it has a pleasant and subtle fragrance."
    },
    {
     "comment": "Pleasant,aquatic smell,hints of green apple,and powder,it’s nice for all occasions,and this one doesn’t annoy my bride."
    }
   ]
  },
  {
   "name": "Lacoste Pour Homme",
   "url": "https://www.fragrancenet.com/cologne/lacoste/lacoste-pour-homme/edt#132864",
   "comments": [
    {
     "comment": "To my nose.... Versace blue jeans if you swapped the smooth vanilla tobacco with a sweet bubble gum. Young or gym, easy blind buy. Lasts 2-4 hrs"
    },
    {
     "comment": "This cologne smells exquisite, I am really glad I bought this and would definitely buy again."
    },
    {
     "comment": "Great scent excellent perfume"
    },
    {
     "comment": "I really like this cologne….smells really good."
    },
    {
     "comment": "Unique scent, my fiancee loves it and so do I. Some reviews say it doesn't last long but I haven' t found that to be the case. I can smell it on me throughout the day. Definitely a good buy."
    }
   ]
  },
  {
   "name": "Boucheron",
   "url": "https://www.fragrancenet.com/cologne/boucheron/boucheron/eau-de-parfum#120600",
   "price": "$54.99",
   "comments": [
    {
     "comment": "Boucheron has a unique manly fragrance. My whole family likes when I wear it. It does last all day and I would only recommend it to my best friends! I don't want to share it with everyone! I put this in my category with Wind Drift by English Leather, although Boucheron is HIGHER on this short list. I hope it's never discontinued! It's all I use!"
    },
    {
     "comment": "My skin and clothes smell like the sweetness of Boucheron all the time and loving it. Yes now!"
    },
    {
     "comment": "I first bought this for my husband about 20 years ago and we loved it. Although I bought others for him, this fragrance is the best. I even spray after clean the bathroom and this smells lift my spirit. I wish I can find women's perfume that makes me feel this good..."
    },
    {
     "comment": "I smell like a grandpa, and I love it!"
    },
    {
     "comment": "Only Cologne (Boucheron)will ever have in my house... LOVE IT!! Thank you very much..............."
    }
   ]
  },
  {
   "name": "Y",
   "url": "https://www.fragrancenet.com/cologne/yves-saint-laurent/y/eau-de-parfum#325122",
   "comments": [
    {
     "comment": "THIS IS MY FAVORITE ALL TIME SMELL GOODS… BUT IS A BIT PRICEY BUT ITS VERY WELL WORTH IT!.. I SCORE EVERYTIME I PUT IT ON!.."
    },
    {
     "comment": "Smells good, lasts all day. I would recommend."
    },
    {
     "comment": "Been wanting for a while now and finally made the purchase. Clean fresh and long lasting."
    },
    {
     "comment": "This fragrance was a must have, projects very well and easily last 8 plus hours. Love this scent!"
    },
    {
     "comment": "Not Happy with this one. 1 hour later I can't smell it! Skip this one!"
    }
   ]
  },
  {
   "name": "Jaipur",
   "url": "https://www.fragrancenet.com/cologne/boucheron/jaipur/eau-de-parfum#116554",
   "comments": [
    {
     "comment": "I have been use jasper and Boucheron Prefum since 1994 .being buying from here since early 2004 . Everyone complements on it ."
    },
    {
     "comment": "I have been use jasper and Boucheron Prefum since 1994 .being buying from here since early 2004 . Everyone complements on it ."
    },
    {
     "comment": "I have been use jasper and Boucheron Prefum since 1994 .being buying from here since early 2004 . Everyone complements on it ."
    },
    {
     "comment": "I have used Jaipur for years. The scent is wonderful and lasts all day. It is not uncommon that someone comments how good I smell and want to know what I’m wearing. It is my go to fragrance."
    },
    {
     "comment": "When I ordered it, I didn't know how it smell like but I was convinced it will the good one and I was right in the end. I like the way it smell and it lasts long too. I'm very satisfied with my purchase and the discount on the product. I would recommend it."
    }
   ]
  },
  {
   "name": "Creed Millesime Imperial",
   "url": "https://www.fragrancenet.com/fragrances/creed/creed-millesime-imperial/eau-de-parfum#298365",
   "comments": [
    {
     "comment": "I love this and if Creed ever fixes the performance then I’ll buy a lifetime suply. Milestone last longer, but has a weird floral bloom."
    },
    {
     "comment": "I was introduced to this. My current favorite. Lasts long time."
    },
    {
     "comment": "This is the BEST! One of my favorite scents....S"
    },
    {
     "comment": "This Creed is a really nice scent, it's Knight and fresh to me. I'm not sure how long it last but it will be one of my go to fragrance."
    },
    {
     "comment": "I love Creed. Its long lasting and elegant. I have 4 scents of Creed."
    }
   ]
  },
  {
   "name": "Spicebomb Extreme",
   "url": "https://www.fragrancenet.com/cologne/viktor-and-rolf/spicebomb-extreme/eau-de-parfum#284445",
   "comments": [
    {
     "comment": "The wife loves this one. It comes in a grown a__ man bottle! It has presence. When you wear this make sure you have on your big Invicta divers watch, larger necklace, and or big bracelet. This one says I'm right here!"
    },
    {
     "comment": "I bought this for my husband and he said this was a good pick. he love it and I love to smell it on him."
    },
    {
     "comment": "This colone is the bomb! Wear it day or night Lots of compliments from my girlfriend ,friends as well as strangers This is a must if you love sweet ,clean smells This is my all time favorite!walk in a room and you will leave a beautiful trail light crisp and a combination of spices ! A must gentleman. Dj McKinney Tx"
    },
    {
     "comment": "I wore Spice Bomb for years and had many compliments. It was my go to “special Cologne” It was so special I did not use it for my everyday cologne. I ordered the EXTREME and it’s scent is close to Spice Bomb. I was looking for the “ Extreme“ in the Extreme Spice Bomb and do not feel it is stronger, spicier, or longer lasting. I like my new Extreme Spice Bomb but will go back to regular Spice Bomb once I use this bottle up."
    },
    {
     "comment": "very good, very warm scent, as well as a strong smell of vanilla . smells feminine but still amazing"
    }
   ]
  },
  {
   "name": "L'Eau d'Issey Pour Homme Intense",
   "url": "https://www.fragrancenet.com/cologne/issey-miyake/leau-dissey-pour-homme-intense/edt#155330",
   "comments": [
    {
     "comment": "The best parfume of issey miyake i love it"
    },
    {
     "comment": "Worst fragrance ever... stinks and lasts forever"
    },
    {
     "comment": "This is possibly the best version of Issey to me! It doesn't project too hard, but it lasts a long time! Love the smell, it's not super sweet, it smells manly!"
    },
    {
     "comment": "I didn’t like the smell, very strong but I wouldnt recommend this particular one"
    },
    {
     "comment": "I didn’t like the smell, very strong but I wouldnt recommend this particular one"
    }
   ]
  },
  {
   "name": "Versace Pour Homme Oud Noir",
   "url": "https://www.fragrancenet.com/cologne/gianni-versace/versace-pour-homme-oud-noir/eau-de-parfum#237817",
   "comments": [
    {
     "comment": "Very mature, dark, seductive, luxury smelling."
    },
    {
     "comment": "Great scent and nice. Deep woodsy smell. Only complaint is lasting power is weak. Strong scent on spray but fades within hours."
    },
    {
     "comment": "This was a blind buy and an introduction to oud fragrances. It’s woody and sweet with a touch of incense yet light and airy. It’s sexy"
    },
    {
     "comment": "Slightly difficult in the opening but after about 3 minutes it becomes this exquisite (my wife's words) scent. Definitely a very wearable and interesting Oud. I highly recommend this (almost niche) designer scent."
    },
    {
     "comment": "I very much enjoy this scent. It’s deep and mysterious while having a hint of sweetness. I have heard people compare it to TF Oud Wood and can confirm that it has some similarities in the deep oudy notes. It is strong at first but I got accustomed to it after a few sniffs. I highly recommend."
    }
   ]
  },
  {
   "name": "Tommy Hilfiger",
   "url": "https://www.fragrancenet.com/cologne/tommy-hilfiger/tommy-hilfiger/edt#256891",
   "comments": [
    {
     "comment": "This is my son’s favorite fragrance. Has been wearing it for years and the only fragrance he will wear."
    },
    {
     "comment": "Best of the best, all ladies loved it teen & matures"
    },
    {
     "comment": "Crisp, clean, every day scent!"
    },
    {
     "comment": "Bough it for my children& they love it as much as I do . Smell is smooth & with one spray is enough for all day ! SIZE is a PLUS FOR THE PRICE !!!"
    },
    {
     "comment": "Been using Tommy for about 20+ years and will always be one of my favorites Smells great and would recommend to any men."
    }
   ]
  },
  {
   "name": "Terre d'Hermes",
   "url": "https://www.fragrancenet.com/cologne/hermes/terre-dhermes/parfum#187417",
   "comments": [
    {
     "comment": "This fragrance opens with the strong punch of a bitter orange and an underlying sweetness that almost reminds me of La Nuit De L’Homme (just the sweet part). I was expecting for it to dry down to be more sweet, but it actually dries down to be spicier. There is a mature, almost musk-like quality as it sits on the skin which I can certainly see to be more appropriate on an older gentleman; sitting at the thanksgiving table wearing a woolen suit or cashmere sweater, indulging in pumpkin pie or cranberry sauce. The top note of orange disappears rather rapidly and becomes a shadow which underlies the fall spices and woody aromas which are most prevalent. An extremely seasonal fragrance, best suited for fall."
    },
    {
     "comment": "I love the scent. It reminds me of a scent by Jean Patou from the sixties for Izod that was discontinued. I just wish it had more holding power. I bought the parfum hoping it would last longer."
    },
    {
     "comment": "I am a man that recently became interested in higher line fragrances. Terre's scent no doubt smells different and unique on every individual wearing it. First, there is this bold scent of leather that later reminds me of spices. Cold weather may be the best time of the year to wear this interesting fragrance - at least for me."
    },
    {
     "comment": "I am a woman and I LOVE wearing Terre! A friend of mine had it on several years ago and I was like, \"What in the world are you wearing?\" It was Terre. Honestly, it is the best smelling stuff!!! Both men and women alike always comment about how wonderful it smells! It's rich & bold yet, tones down to an intoxicating warm scent. I remember having it on and I was standing outside and the wind came from behind, whisking the scent off of me into the crowd of people, no less then 8 people were affected by it...searching for the \"wearer of the scent\"! I can't get enough of it! Superb!"
    },
    {
     "comment": "It's slightly better than the edt in a way but not as loud and less projection yet it has this stronger background intensity thing going. Terre D'hermes is kind of like an acquired taste. it is it's own unique fragrance that I can understand if someone hates it. It almost reminds me of a bitter lemmonade that's completely unsweetened with orange peel and dirty earthy notes. Not for everyone and not really an uplifting scent but in it's own way it is pleasant to wear on occasion because I don't think it will offend anyone."
    }
   ]
  },
  {
   "name": "Kenneth Cole Reaction",
   "url": "https://www.fragrancenet.com/cologne/kenneth-cole/kenneth-cole-reaction/edt#134785",
   "comments": [
    {
     "comment": "It's the only one he likes! Thanks"
    },
    {
     "comment": "This summer scent is perfect, not too strong but enough make smiles a little bigger and noses happier. There is nothing out there that compares with this one in this particular price range…. and I’d even put this one to the test against the top-shelf brands."
    },
    {
     "comment": "This scent has always been one of my favorites. Not too strong, but a smooth, smell mostly for the night time. Love it"
    },
    {
     "comment": "This product is absolutely amazing and smells absolutely amazing very happy with my product"
    },
    {
     "comment": "This product is absolutely amazing and smells absolutely amazing very happy with my product"
    }
   ]
  },
  {
   "name": "Armani Code Profumo",
   "url": "https://www.fragrancenet.com/cologne/giorgio-armani/armani-code-profumo/parfum#284201",
   "comments": [
    {
     "comment": "This is absolutely special. Extremely long lasting, great sillage, great projection. Perfect for dates , clubbing, or work. Every man needs this"
    },
    {
     "comment": "This perfume is amazing, compliments all the time. Armani you have done it again. Excellent job."
    },
    {
     "comment": "If your a man into spicy scents, this is the primo choice. Bold yet subtle and lingers pleasantly for hours. My new favorite spice. One of the best in my opinion."
    },
    {
     "comment": "This is such a beautiful scent. All those that have already provided raves about this cologne are on the money. It is a very special scent and worth it. Initial spray comes off a bit sweet, light and lively and then gradually settles into a darker, subtle and very masculine scent. A little goes a long way so do not over do it. Definitely appeals to the women so lets hope not to many guys are using it because you will want this one as a personal signature! This formula has amazing tones and the designers deserve all the credit as they hit the mark perfectly."
    },
    {
     "comment": "This smells so amazing, you will get so many compliments guys, i am tellin you. This one, code absolutu and absolutu gold are amazing af."
    }
   ]
  },
  {
   "name": "Jimmy Choo Intense",
   "url": "https://www.fragrancenet.com/cologne/jimmy-choo/jimmy-choo-intense/edt#289009",
   "comments": [
    {
     "comment": "I stopped showering after I bought this thats how good it is. Now I just bathe in cologne plus a couple sprays down the pants and waaalaaa... Have a hard time keeping the chicks off of me. Even if you are pretty dirty you can just dump it on you and the dirt comes right off. I would give it 100 stars if I could. Im thinking I might start drinking it too so I dont need to brush my teeth anymore and maybe I will sweat this love honey!"
    },
    {
     "comment": "This is my husband favorite love the clean and fresh smell last all day"
    },
    {
     "comment": "This is my husband favorite wonderful smell"
    },
    {
     "comment": "This fragrance is by far on of my favorites, it truly makes you smell like a man. Highly recommended this for a date night fragrance, casual fragrance, maybe even a formal fragrance. You really can't go wrong with choosing Jimmy Choo Man Intense."
    },
    {
     "comment": "I used Jimmy Choo Man and liked it - bought the \"Jimmy Choo Man Intense\" to see how \"intense\" it is. Not intense and will go back to using \"Jimmy Choo Man\" as it seems to linger all day."
    }
   ]
  },
  {
   "name": "F By Ferragamo Pour Homme Black",
   "url": "https://www.fragrancenet.com/cologne/salvatore-ferragamo/f-by-ferragamo-pour-homme-black/edt#167033",
   "comments": [
    {
     "comment": "Un perfume bien sutil ..la verdad me ha impresiodado mucho su salida y secado ... Aroma seductora sexy y masculino q todo hombre debería tener en su repertorio ; la verdad la recomiendo mucho y se q a las ladies led va encantar ..... Good Luck gays"
    },
    {
     "comment": "Great product the smell is amazing. In my opinion it fits all sorts of guys(scent last around 5 hrs). I recommend guys to buy this gem."
    },
    {
     "comment": "Very nice fragrance & would definitely recommend. It’s a all rounded fragrance can be used everywhere."
    },
    {
     "comment": "Great ! Amaizing usl lanuit le homme clon"
    },
    {
     "comment": "While the smell is super nice: fresh and citrusy on opening notes and nice musky/vetiver smell on a base, this fragrance has a longevity of ...zero!!! It lasts 40 min!! First, I thought it's my husbands specific biochemistry, so I used it on myself (since the smell is somewhat unisex) - nope... same 40 min to an hour the most. Will not buy again."
    }
   ]
  },
  {
   "name": "Ck2",
   "url": "https://www.fragrancenet.com/fragrances/calvin-klein/ck2/edt#281315",
   "comments": [
    {
     "comment": "This has been my favorite for several years. It’s a warm scent but not overpowering. I always get compliments when wearing it. So glad I can get it for such a good price at Fragrancenet!"
    },
    {
     "comment": "Excellent! One of the best I have found that is universal male or female and smells fabulous!"
    },
    {
     "comment": "Excellent! One of the best I have found that is universal male or female and smells fabulous!"
    },
    {
     "comment": "This my go to fragrance. So hate that it's discontinued. Smells differently on men & women. But love it on my man & myself."
    },
    {
     "comment": "My preference for a clean fresh scent with a twist of citrus. Never goes unnoticed by others. Others have purchased because of me and it’s hard to find. Scent doesn’t last long but I have no issues reapplying. This is one of my main go to’s regardless of season."
    }
   ]
  }
 ]
}